In [76]:
import pandas as pd

In [77]:
df = pd.read_csv('./data/Iris.csv')

In [78]:
#print the first five rows

df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [79]:
#print the last five rows

df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [80]:
df.loc[["SepalWidthCm",'PetalWidthCm']]

KeyError: "None of [Index(['SepalWidthCm', 'PetalWidthCm'], dtype='object')] are in the [index]"

In [81]:
# print the columns names
# let's print it as a list
print(list(df.columns))

['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm', 'Species']

In [82]:
# check the index
df.index

RangeIndex(start=0, stop=150, step=1)

In [83]:
# change the column names 
# way1

# way2
df.rename(columns={'SepalLengthCm': 'SLengthCm'}, inplace=True)

In [84]:
# select the column "Sepal Length" 
# way 1
df["SLengthCm"].tolist()
#way2

[5.1,
 4.9,
 4.7,
 4.6,
 5.0,
 5.4,
 4.6,
 5.0,
 4.4,
 4.9,
 5.4,
 4.8,
 4.8,
 4.3,
 5.8,
 5.7,
 5.4,
 5.1,
 5.7,
 5.1,
 5.4,
 5.1,
 4.6,
 5.1,
 4.8,
 5.0,
 5.0,
 5.2,
 5.2,
 4.7,
 4.8,
 5.4,
 5.2,
 5.5,
 4.9,
 5.0,
 5.5,
 4.9,
 4.4,
 5.1,
 5.0,
 4.5,
 4.4,
 5.0,
 5.1,
 4.8,
 5.1,
 4.6,
 5.3,
 5.0,
 7.0,
 6.4,
 6.9,
 5.5,
 6.5,
 5.7,
 6.3,
 4.9,
 6.6,
 5.2,
 5.0,
 5.9,
 6.0,
 6.1,
 5.6,
 6.7,
 5.6,
 5.8,
 6.2,
 5.6,
 5.9,
 6.1,
 6.3,
 6.1,
 6.4,
 6.6,
 6.8,
 6.7,
 6.0,
 5.7,
 5.5,
 5.5,
 5.8,
 6.0,
 5.4,
 6.0,
 6.7,
 6.3,
 5.6,
 5.5,
 5.5,
 6.1,
 5.8,
 5.0,
 5.6,
 5.7,
 5.7,
 6.2,
 5.1,
 5.7,
 6.3,
 5.8,
 7.1,
 6.3,
 6.5,
 7.6,
 4.9,
 7.3,
 6.7,
 7.2,
 6.5,
 6.4,
 6.8,
 5.7,
 5.8,
 6.4,
 6.5,
 7.7,
 7.7,
 6.0,
 6.9,
 5.6,
 7.7,
 6.3,
 6.7,
 7.2,
 6.2,
 6.1,
 6.4,
 7.2,
 7.4,
 7.9,
 6.4,
 6.3,
 6.1,
 7.7,
 6.3,
 6.4,
 6.0,
 6.9,
 6.7,
 6.9,
 5.8,
 6.8,
 6.7,
 6.7,
 6.3,
 6.5,
 6.2,
 5.9]

In [85]:
# select the column "Sepal Length"  and "Sepal width"
df[["SLengthCm", "SepalWidthCm"]]

     SLengthCm  SepalWidthCm
0          5.1           3.5
1          4.9           3.0
2          4.7           3.2
3          4.6           3.1
4          5.0           3.6
..         ...           ...
145        6.7           3.0
146        6.3           2.5
147        6.5           3.0
148        6.2           3.4
149        5.9           3.0

[150 rows x 2 columns]

In [86]:
df = pd.DataFrame([['Tom',15,'Male','middle'],['Alice',10, 'Female','elementary']], columns =['Name','Age','gender','School'])

In [87]:
df

    Name  Age  gender      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [88]:
# check the index
df.index

RangeIndex(start=0, stop=2, step=1)

In [89]:
df

    Name  Age  gender      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [95]:
# change the index (0: stud1, 1:stud2)
# way 1
new_index= ["stud1","stud2"]
df["newIndex"]=new_index
df.set_index("newIndex", inplace=True)
# check the index
print(df.head())
df.index

           Name  Age  gender      School    NEW
newIndex
stud1       Tom   15    Male      middle  stud1
stud2     Alice   10  Female  elementary  stud2

Index(['stud1', 'stud2'], dtype='object', name='newIndex')

In [ ]:
# way 2

# check the index

In [ ]:
# way 3

# check the index

In [96]:
exam_data = {
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [99]:
# transform into dataFrame(index :stud1, stud2, stud3)
index= ["stud1","stud2","stud3"]
df= pd.DataFrame(exam_data, index=index)
df

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90
stud3    70   95    100       90

In [104]:
# make three copy (df1,df2,df3, df4)
df1= df.copy()
df2= df.copy()
df3= df.copy()
df4= df.copy()

In [105]:
#drop stud2 from df1
df1.drop("stud2")

       math  eng  music  science
stud1    90   98     85      100
stud3    70   95    100       90

### drop stud2 and stud3 from df2
df2.drop("stud2")

In [109]:
#drop the columns 'music' from df3
df3.drop("music", axis=1)

       math  eng  science
stud1    90   98      100
stud2    80   89       90
stud3    70   95       90

In [112]:
#drop the columns 'music'  and science from df4

df4.drop(["music","science"],axis=1)

       math  eng
stud1    90   98
stud2    80   89
stud3    70   95

# indexing and slicing

In [116]:
# select the first row using 'iloc'
df.iloc[0]

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [117]:
# select the first row using 'loc'
df.loc["stud1", "math":"science"]

math        90
eng         98
music       85
science    100
Name: stud1, dtype: int64

In [119]:
# select the 'stud1' and 'stud2' using iloc
df.iloc[0:2, ]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [120]:
# select the 'stud1' and 'stud2' using loc
df.loc["stud1":"stud2",]

       math  eng  music  science
stud1    90   98     85      100
stud2    80   89     95       90

In [221]:
exam_data = {
    "name":['hongildong','hongeeedong','hongsamdong'],
    "math":[90,80,70],
    "eng":[98,89,95],
    "music":[85,95,100],
    "science":[100,90,90]
}

In [222]:
# transform into dataFrame
df=pd.DataFrame(exam_data)
df

          name  math  eng  music  science
0   hongildong    90   98     85      100
1  hongeeedong    80   89     95       90
2  hongsamdong    70   95    100       90

In [223]:
# set the column "name" as the new index
df.set_index("name", inplace=True)

In [224]:
# select music score of hongildong
df["music"][0]

85

In [225]:
# select music and science score of hongildong
#using iloc 
print(df.iloc[0, 2:5])
#using loc
print(df.loc["hongildong","music":"science"])

music       85
science    100
Name: hongildong, dtype: int64
music       85
science    100
Name: hongildong, dtype: int64

In [226]:
# ### slicing
#select math, eng, music, and science score of hongeeedong
#using iloc 
df.iloc[0,:]

math        90
eng         98
music       85
science    100
Name: hongildong, dtype: int64

In [227]:
#using loc
df.loc["hongildong",]

math        90
eng         98
music       85
science    100
Name: hongildong, dtype: int64

In [228]:
#select math, eng, music, and science score of hongeeedong and hongildong
#using iloc 
df.iloc[0:2,]

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90

In [229]:
#using loc
df.loc["hongildong":"hongeeedong",]

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90

In [230]:
# add a new column
physics=[45 ,57, 90]
df.assign(physics=physics)

             math  eng  music  science  physics
name
hongildong     90   98     85      100       45
hongeeedong    80   89     95       90       57
hongsamdong    70   95    100       90       90

In [231]:
# add a new row
df.loc[len(df.index)]=[50, 60, 70, 80]

In [232]:
df

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90
3              50   60     70       80

In [233]:
df.rename(index={3:'added_arrow'}, inplace=True)

In [234]:
df

             math  eng  music  science
name
hongildong     90   98     85      100
hongeeedong    80   89     95       90
hongsamdong    70   95    100       90
added_arrow    50   60     70       80